package report.umwoosung.r0014;
/*try{
 * }catch( Exception) 강제하는법.
 * 클래스 throws 함수 -만약 에러가나면 호출한 함수에서처리.
 *  에러를 던져주는것?
 * 
 * 
 * 
 * throws 를 쓰게되면 
 * 1.try catch 문을 써줘야한다.
 * 2.
 * 
 * static int a=1;으로 만들면 주소값은 단 하나만 존제한다.
 * 객체를 만든다고해도 값은 하나뿐이다.
 * 아무리 new 를 해도 다시 초기화 되지않느다.
 * (한번바뀌면 여러 자원들이 이값을 사용할떄 무조건 같아야하는값에 사용
 *  ex.카톡의 상태메시지)
 *  static 으로 하면 클래스로 접근을 할수있다.
 * 
 * prepareStatement 
 * 
 * rs(result set)
 * 1.컬럼부터 읽고 로우의대한정보를 읽는다.
 * 
 * primary key.
 * num int AUTO_INCREMENT primary key, 절대로 중복되서 들어가지않는다.
 * AUTO_INCREMENT(자동으로 값을 넣어준다.)%한번 값이 올라가면 절대로 다시 돌아가지않는다.
 * (이미 4가 입력되고 4를 지우고 다시 하나를 넣으면 4가되지않고 5가된다.)
 * 
 * <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
 * 구아바
 * 쪽지시험 3번
 * 아래에서 5명
 * >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 */
