package report.umwoosung;
/*	html
 * h 태그
 * <h1>이 제일큰것 <h7>이 제일작은것.
 *br태그 1번 개행되는것.(중복가능)
 *p태그
 *<p/>더블개행되는것. (중복불가)
 *a태그
 *이미지태그
 *<img src="">html과 같은 폴더에 있어야한다.(상대경로)
 *상대경로는 파일이 같이 이동해야되기떄문에 노추천.
 *span태그-그자리를 차지하는것?(거의안씀)
 *div태그-span과 같지만 자동으로 개행됨.
 *모든 이미지들은 사이즈를 가지고있어서 강제로 지정해주지않으면 그 크기만큼 표현된다.
 *ul태그 - ul태그 안에있는 li태그들은 앞에 자동으로 .이 찍혀서 나온다.
 *#을쓴건 아이디에먹힌다.
 *.at4라고하면 at4안에 있는 클래스들은 모두다 그디자인이 먹힌다.
 *link태그
 *
 *절대경로 내가 지금쓰는 이클립스내에선 web_content
 *자바스크립트에 선언한 파라메터는 무조건 옵션파라메터다.(옵션파라메터가 호출이 안되도 null값만 나오고 호출은 된다.)
 *자바스크립트는 오버로딩의 기능은 없고 오버라이딩의 기능만있다.
 *
 */
