package report.umwoosung.r0010;

/*Next 다음레코드로 이동한다.
 * while() 파라메터값이 만족할때까지 한다.
 * add 더하는기능
 * size array의 범위
 * get 불러들이기.<<
 * remove  초기화.<<
 * 
 * 
 * ArrayList< >list = new ArrayList<>():
 * 어떠한 데이터 타입도 담을수있다.
 * .add("") 데이터타입을 ArrayList 에 값을 담을때.
 * .remove("") ArrayList 
 * .get 
 * 
 * 
 * containsKey("key")key 값을 가지고있는지 없는지 확인하는 명령어.
 * 
 * toString 그냥 Object에 선언되어있는 값일뿐이고 toString으로 오버라이딩한것뿐 그이상 그이하의 의미는 없다.
 * 
 * Arrays.sort(); -()안에있는걸 정렬한다.
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 오버로딩
 * 1.생성자와 함수의 차이를 서술해주세요.
 * 함수. 리턴타입 있어도되고 없어도되고 없으면 void써줘야됨.
 * 2.오버로딩에 대해서 서술해주세요.
 * 함수명이 같아야한다.
 * 매개변수가 달라야한다.갯수가 달라야한다.
 * 
 * -----------
 * 1.MY-SQL 이란 무엇인가 서술해주세요
 * -관계형 데이터베이스 시스템
 * 2.MY-SQL설치방법을 서술해주세요
 * - 구글mariadb검색.
 * -다운로드(Msi로 다운)
 * 2.my-aql설치방법
 *  -https://downloads.mariadb.org/interstitial/mariadb-10.2.6/winx64-packages/mariadb-10.2.6-winx64.msi/from/http%3A//ftp.kaist.ac.kr/mariadb/
 * -윈도우 64비트 설치
 * -비밀번호입력,비밀번호확인 UTF8체크
 * -신규 누르고 암호입력
 * -쿼리 누르고
 * 
 * 1.create database iot_test;
 * 2.ctrl shift f9(이후 새로고침)
 * 
 * 3.use iot_test;
 * create table test(
 *id varchar(30), 
 *pwd varchar(30),
 *name varchar(30)
 * );
 * 가로안에 입력창 가져다 둔후ctrl shift f9(이후 새로고침)
 * unnamed 클릭후 새로고침
 * 
 * ------------
 * 시스템창에서 64비트 확인.
 * jdk1.8 검색 후 다운로드
 * 다운로드 주소:jdk링크주소복사후
 * 다운로드후 설치,
 * -----------------------
 * 이클립스.EE버전.압축본으로 다운받아야한다.64비트 
 *주소 복사후
 *압축품.
 * ----------
 * 톰캣8.5 구글링. 64비트 다운로드.
 * (파일명만 써도 ㅇㅈ)
 * 다운받아 압축품.
 * 5.이클립스에 톰캣 설정
 * -new 서버 클릭후
 * -피니쉬.
 * 
 * ----------------
 * http의 기본포트는 무엇이며 이클립스에 셋팅하는 서버(톰캣)에서 포트를 바꾸는 방법을 서술해주세요
 *1. 80
 *아래서버 더블클릭후
 * 2.포트에서 8080을 80으로 바꾼후 ctrl+s
 * ----------------------------------
 * 국제 네트워크 표준모델인 OSI7계층도를 작성해주세요
 * 
 * <<알아와주세요>>
 * 
 * Lan이란
 * 300m이하의 통신회선으로 연결된 통신망
 * 네트워크 매체를 이용하여 집 사무실 학교등 건물과 같은 가까운 지역을 한데묶은 컴퓨터 네트워크
 * 한정된 지역에서 컴퓨터를 기본으로 하는 여러가지 전자기기 사이의 자유로운 정보교환
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
