package report.umwoosung.r0012;
/*함수 호출하는법.
 * 1. 함수가 있는 생성자를 변수로 만듬
 * 2. 변수.결과값 = 변수.함수명();
 * 
 * 재기호출 - 내자신을 호출하는것.(잘못하면 무한루프가 돈다.)
 * 
 * scan.nextLine(); 입력한것을 받아라.
 * 
 * ArrayList 와 배열의 차이점.  방갯수입력,
 * 사용명령어.
 * 1 변수.add(index);-()안에있는것을 0번방부터 순서대로 입력한다.
 * 2 .get(index) -()안에있는것을 불러온다.
 * 3 .size(); - ArrayList의 최대값을 반환한다.(=배열의 .length와 같음)
 * 
 * HashMap
 * 사용명령어.
 * .put(key, value)- key와 value 를 저장할수있다.
 * .get("") - ""안에있는것을 불러온다.
 * 
 * final
 * 
 * 변수-변수에 넣으면 같은 클래스에서만 변할수있지만 그클래스
 * 내에있는 다른함수를 다른곳에서 재정의해서 값을 바꿀수있다.
 * 클래스-클래스가 상속되지 않는다.
 * 함수-함수가 재정의 되지 않는다.
 * 
 * 메모리를 생성할때 반듯이 생성자를 호출한다.
 * Exam e = new Exam(); 라고 했을
 * Exam e 부분까지만 호출인것이고
 * = next Exam(); new 의 뒷부분은 생성자를 호출하는것으로 
 * 그생성자가 실행하는것이 있으면 자동으로실행된다.
 * 
 * 
 * 
 */

